data/raw/gpu_load_control/qwen/background_logs/qwen_bgload_c32i256o256_probeconc4_run1_conc32.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x78bcc5ba0fe0>, trust_remote_code=False, seed=0, num_prompts=40, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=256, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=32, model='Qwen/Qwen2.5-7B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['role=background_load', 'label=c32i256o256_probeconc4_run1', 'iteration=1'], result_dir='./fixd_load_control_runs/qwen/background_logs/iterations', result_filename='qwen_bgload_c32i256o256_probeconc4_run1_conc32_iter1.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-c3ec2c26-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-26 12:56:43 [datasets.py:631] Sampling input_len from [256, 256] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 40/40 [00:10<00:00,  3.67it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     40        
Failed requests:                         0         
Maximum request concurrency:             32        
Benchmark duration (s):                  10.90     
Total input tokens:                      10240     
Total generated tokens:                  10240     
Request throughput (req/s):              3.67      
Output token throughput (tok/s):         939.44    
Peak output token throughput (tok/s):    1504.00   
Peak concurrent requests:                40.00     
Total token throughput (tok/s):          1878.88   
---------------Time to First Token----------------
Mean TTFT (ms):                          177.25    
Median TTFT (ms):                        208.88    
P99 TTFT (ms):                           212.19    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          21.29     
Median TPOT (ms):                        21.59     
P99 TPOT (ms):                           21.82     
---------------Inter-token Latency----------------
Mean ITL (ms):                           21.21     
Median ITL (ms):                         21.53     
P99 ITL (ms):                            22.55     
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x72d639b98fe0>, trust_remote_code=False, seed=0, num_prompts=40, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=256, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=32, model='Qwen/Qwen2.5-7B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['role=background_load', 'label=c32i256o256_probeconc4_run1', 'iteration=2'], result_dir='./fixd_load_control_runs/qwen/background_logs/iterations', result_filename='qwen_bgload_c32i256o256_probeconc4_run1_conc32_iter2.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-11ff6001-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-26 12:57:02 [datasets.py:631] Sampling input_len from [256, 256] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 40/40 [00:10<00:00,  3.65it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     40        
Failed requests:                         0         
Maximum request concurrency:             32        
Benchmark duration (s):                  10.95     
Total input tokens:                      10240     
Total generated tokens:                  10240     
Request throughput (req/s):              3.65      
Output token throughput (tok/s):         935.55    
Peak output token throughput (tok/s):    1472.00   
Peak concurrent requests:                40.00     
Total token throughput (tok/s):          1871.10   
---------------Time to First Token----------------
Mean TTFT (ms):                          169.95    
Median TTFT (ms):                        199.22    
P99 TTFT (ms):                           203.20    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          21.47     
Median TPOT (ms):                        21.81     
P99 TPOT (ms):                           22.05     
---------------Inter-token Latency----------------
Mean ITL (ms):                           21.38     
Median ITL (ms):                         21.52     
P99 ITL (ms):                            28.51     
==================================================